import type { RawTable } from "@/types";

export const examReports = [
  {
    "caseId": "PICU-2026-0503",
    "id": "exam_reports",
    "name": "检查报告表",
    "system": "检查/PACS",
    "columns": [
      "检查时间",
      "检查类型",
      "结论"
    ],
    "rows": [
      {
        "检查时间": "2026-05-03 09:22",
        "检查类型": "胸部影像",
        "结论": "双肺感染性改变，建议结合临床及实验室指标。"
      },
      {
        "检查时间": "2026-05-03 09:22",
        "检查类型": "心电图",
        "结论": "窦性心动过速，PR/QRS间期待结构化回填。"
      }
    ],
    "linkedFields": [
      "f019_感染指标_PCT",
      "f072_仪器检查_心电图",
      "f073_仪器检查_影像学"
    ]
  },
  {
    "caseId": "PICU-2026-0511",
    "id": "exam_reports",
    "name": "检查报告表",
    "system": "检查/PACS",
    "columns": [
      "检查时间",
      "检查类型",
      "结论"
    ],
    "rows": [
      {
        "检查时间": "2026-05-11 14:05",
        "检查类型": "胸部影像",
        "结论": "双肺感染性改变，建议结合临床及实验室指标。"
      },
      {
        "检查时间": "2026-05-11 14:05",
        "检查类型": "心电图",
        "结论": "窦性心动过速，PR/QRS间期待结构化回填。"
      }
    ],
    "linkedFields": [
      "f019_感染指标_PCT",
      "f072_仪器检查_心电图",
      "f073_仪器检查_影像学"
    ]
  },
  {
    "caseId": "PICU-2026-0520",
    "id": "exam_reports",
    "name": "检查报告表",
    "system": "检查/PACS",
    "columns": [
      "检查时间",
      "检查类型",
      "结论"
    ],
    "rows": [
      {
        "检查时间": "2026-05-20 18:40",
        "检查类型": "胸部影像",
        "结论": "双肺感染性改变，建议结合临床及实验室指标。"
      },
      {
        "检查时间": "2026-05-20 18:40",
        "检查类型": "心电图",
        "结论": "窦性心动过速，PR/QRS间期待结构化回填。"
      }
    ],
    "linkedFields": [
      "f019_感染指标_PCT",
      "f072_仪器检查_心电图",
      "f073_仪器检查_影像学"
    ]
  },
  {
    "caseId": "PICU-2026-0528",
    "id": "exam_reports",
    "name": "检查报告表",
    "system": "检查/PACS",
    "columns": [
      "检查时间",
      "检查类型",
      "结论"
    ],
    "rows": [
      {
        "检查时间": "2026-05-28 11:16",
        "检查类型": "胸部影像",
        "结论": "双肺感染性改变，建议结合临床及实验室指标。"
      },
      {
        "检查时间": "2026-05-28 11:16",
        "检查类型": "心电图",
        "结论": "窦性心动过速，PR/QRS间期待结构化回填。"
      }
    ],
    "linkedFields": [
      "f019_感染指标_PCT",
      "f072_仪器检查_心电图",
      "f073_仪器检查_影像学"
    ]
  }
] satisfies RawTable[];
