import type { RawTable } from "@/types";

export const followup = [
  {
    "caseId": "PICU-2026-0503",
    "id": "followup",
    "name": "随访记录表",
    "system": "随访",
    "columns": [
      "随访日期",
      "随访方式",
      "结局",
      "备注"
    ],
    "rows": [
      {
        "随访日期": "2026-06-01",
        "随访方式": "电话",
        "结局": "待确认",
        "备注": "放弃治疗后结局需补充"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f003_PICU结局_自动出院_危重放弃治疗_转院"
    ]
  },
  {
    "caseId": "PICU-2026-0511",
    "id": "followup",
    "name": "随访记录表",
    "system": "随访",
    "columns": [
      "随访日期",
      "随访方式",
      "结局",
      "备注"
    ],
    "rows": [
      {
        "随访日期": "2026-06-01",
        "随访方式": "电话",
        "结局": "待确认",
        "备注": "放弃治疗后结局需补充"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f003_PICU结局_自动出院_危重放弃治疗_转院"
    ]
  },
  {
    "caseId": "PICU-2026-0520",
    "id": "followup",
    "name": "随访记录表",
    "system": "随访",
    "columns": [
      "随访日期",
      "随访方式",
      "结局",
      "备注"
    ],
    "rows": [
      {
        "随访日期": "2026-06-01",
        "随访方式": "电话",
        "结局": "待确认",
        "备注": "放弃治疗后结局需补充"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f003_PICU结局_自动出院_危重放弃治疗_转院"
    ]
  },
  {
    "caseId": "PICU-2026-0528",
    "id": "followup",
    "name": "随访记录表",
    "system": "随访",
    "columns": [
      "随访日期",
      "随访方式",
      "结局",
      "备注"
    ],
    "rows": [
      {
        "随访日期": "2026-06-01",
        "随访方式": "电话",
        "结局": "待确认",
        "备注": "放弃治疗后结局需补充"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f003_PICU结局_自动出院_危重放弃治疗_转院"
    ]
  }
] satisfies RawTable[];
