import type { RawTable } from "@/types";

export const patientProfile = [
  {
    "caseId": "PICU-2026-0503",
    "id": "patient_profile",
    "name": "患者基本信息表",
    "system": "EMR/住院病历",
    "columns": [
      "字段",
      "值",
      "来源"
    ],
    "rows": [
      {
        "字段": "病例号",
        "值": "PICU-2026-0503",
        "来源": "住院首页"
      },
      {
        "字段": "床位",
        "值": "PICU-03",
        "来源": "PICU床位表"
      },
      {
        "字段": "年龄性别",
        "值": "7岁 男",
        "来源": "患者主索引"
      },
      {
        "字段": "主要诊断",
        "值": "感染性休克 / 肺部感染",
        "来源": "入院/出院诊断"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f002_PICU结局_临床死亡",
      "f003_PICU结局_自动出院_危重放弃治疗_转院",
      "f004_入PICU主要病因_疾病代码"
    ]
  },
  {
    "caseId": "PICU-2026-0511",
    "id": "patient_profile",
    "name": "患者基本信息表",
    "system": "EMR/住院病历",
    "columns": [
      "字段",
      "值",
      "来源"
    ],
    "rows": [
      {
        "字段": "病例号",
        "值": "PICU-2026-0511",
        "来源": "住院首页"
      },
      {
        "字段": "床位",
        "值": "PICU-04",
        "来源": "PICU床位表"
      },
      {
        "字段": "年龄性别",
        "值": "2岁 女",
        "来源": "患者主索引"
      },
      {
        "字段": "主要诊断",
        "值": "脓毒症 / 急性呼吸衰竭",
        "来源": "入院/出院诊断"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f002_PICU结局_临床死亡",
      "f003_PICU结局_自动出院_危重放弃治疗_转院",
      "f004_入PICU主要病因_疾病代码"
    ]
  },
  {
    "caseId": "PICU-2026-0520",
    "id": "patient_profile",
    "name": "患者基本信息表",
    "system": "EMR/住院病历",
    "columns": [
      "字段",
      "值",
      "来源"
    ],
    "rows": [
      {
        "字段": "病例号",
        "值": "PICU-2026-0520",
        "来源": "住院首页"
      },
      {
        "字段": "床位",
        "值": "PICU-05",
        "来源": "PICU床位表"
      },
      {
        "字段": "年龄性别",
        "值": "9月 男",
        "来源": "患者主索引"
      },
      {
        "字段": "主要诊断",
        "值": "重症肺炎 / 免疫抑制待排",
        "来源": "入院/出院诊断"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f002_PICU结局_临床死亡",
      "f003_PICU结局_自动出院_危重放弃治疗_转院",
      "f004_入PICU主要病因_疾病代码"
    ]
  },
  {
    "caseId": "PICU-2026-0528",
    "id": "patient_profile",
    "name": "患者基本信息表",
    "system": "EMR/住院病历",
    "columns": [
      "字段",
      "值",
      "来源"
    ],
    "rows": [
      {
        "字段": "病例号",
        "值": "PICU-2026-0528",
        "来源": "住院首页"
      },
      {
        "字段": "床位",
        "值": "PICU-06",
        "来源": "PICU床位表"
      },
      {
        "字段": "年龄性别",
        "值": "12岁 女",
        "来源": "患者主索引"
      },
      {
        "字段": "主要诊断",
        "值": "腹腔感染 / 多器官功能障碍",
        "来源": "入院/出院诊断"
      }
    ],
    "linkedFields": [
      "f001_PICU结局_今日出院",
      "f002_PICU结局_临床死亡",
      "f003_PICU结局_自动出院_危重放弃治疗_转院",
      "f004_入PICU主要病因_疾病代码"
    ]
  }
] satisfies RawTable[];
